Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.SystemsAnalysisReport
An external resource type representing systems analysis report path.

Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.MaterialTexture
An external resource type representing material texture images.

Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.Image
An external resource type representing images.

Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.DecalImage
An external resource type representing decal images.